app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      if @artist = Artist.find_by_id(params[:artist_id])
        @songs = @artist.songs
      else
        redirect_to artists_path
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs"

  def show
   @song = Song.find_by_id(params[:id])
   if params[:artist_id]
     @artist = Artist.find_by_id(params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]